tutorials/lagrangian/kinematicParcelFoam/drippingChair/0/hf_film
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       areaScalarField;
    object      hf_film;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 1 0 0 0 0 0];

internalField       uniform 0.0001;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    top
    {
        type        fixedValue;
        value       uniform 0.002;
    }

    bottom
    {
        type        zeroGradient;
    }

    frontAndBack
    {
        type        zeroGradient;
    }
}


// ************************************************************************* //
